## Plan Result (sds_ptl - TerraformPlanApply)




<pre><code>Plan: 9 to add, 8 to change, 0 to destroy.</code></pre>

* Create
  * azurerm_role_assignment.monitoring_reader[&#34;DTS-SHAREDSERVICES-DEMO&#34;]
  * azurerm_role_assignment.monitoring_reader[&#34;DTS-SHAREDSERVICES-DEV&#34;]
  * azurerm_role_assignment.monitoring_reader[&#34;DTS-SHAREDSERVICES-ITHC&#34;]
  * azurerm_role_assignment.monitoring_reader[&#34;DTS-SHAREDSERVICES-PROD&#34;]
  * azurerm_role_assignment.monitoring_reader[&#34;DTS-SHAREDSERVICES-SBOX&#34;]
  * azurerm_role_assignment.monitoring_reader[&#34;DTS-SHAREDSERVICES-STG&#34;]
  * azurerm_role_assignment.monitoring_reader[&#34;DTS-SHAREDSERVICES-TEST&#34;]
  * azurerm_role_assignment.monitoring_reader[&#34;DTS-SHAREDSERVICESPTL&#34;]
  * azurerm_role_assignment.monitoring_reader[&#34;DTS-SHAREDSERVICESPTL-SBOX&#34;]
* Update
  * azurerm_monitor_action_group.action_group
  * azurerm_resource_group.this
  * azurerm_service_plan.this
  * azurerm_storage_account.this
  * azurerm_user_assigned_identity.this
  * azurerm_windows_function_app.this
  * module.application_insights.azurerm_application_insights.this
  * module.application_insights.azurerm_monitor_activity_log_alert.main[0]




<details><summary>Change Result (Click me)</summary>

```hcl

  # data.azurerm_function_app_host_keys.host_keys will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_function_app_host_keys" "host_keys" {
      + blobs_extension_key             = (sensitive value)
      + default_function_key            = (sensitive value)
      + durabletask_extension_key       = (sensitive value)
      + event_grid_extension_config_key = (sensitive value)
      + event_grid_extension_key        = (sensitive value)
      + id                              = (known after apply)
      + name                            = "sds-alerts-slack-ptl"
      + primary_key                     = (sensitive value)
      + resource_group_name             = "sds-alerts-slack-ptl"
      + signalr_extension_key           = (sensitive value)
      + webpubsub_extension_key         = (sensitive value)
    }

  # azurerm_monitor_action_group.action_group will be updated in-place
  ~ resource "azurerm_monitor_action_group" "action_group" {
        id                  = "/subscriptions/6c4d2513-a873-41b4-afdd-b05a33206631/resourceGroups/sds-alerts-slack-ptl/providers/Microsoft.Insights/actionGroups/sds-alerts-slack-warning-alerts"
        name                = "sds-alerts-slack-warning-alerts"
      ~ tags                = {
            "application"  = "core"
            "builtFrom"    = "hmcts/azure-alert-to-slack-function"
            "businessArea" = "Cross-Cutting"
            "criticality"  = "High"
            "environment"  = "production"
          - "startupMode"  = "always" -> null
        }
        # (4 unchanged attributes hidden)

      ~ azure_function_receiver {
          ~ http_trigger_url         = (sensitive value)
            name                     = "slack-alerts"
            # (3 unchanged attributes hidden)
        }
    }

  # azurerm_resource_group.this will be updated in-place
  ~ resource "azurerm_resource_group" "this" {
        id         = "/subscriptions/6c4d2513-a873-41b4-afdd-b05a33206631/resourceGroups/sds-alerts-slack-ptl"
        name       = "sds-alerts-slack-ptl"
      ~ tags       = {
            "application"  = "core"
            "builtFrom"    = "hmcts/azure-alert-to-slack-function"
            "businessArea" = "Cross-Cutting"
            "criticality"  = "High"
            "environment"  = "production"
          - "startupMode"  = "always" -> null
        }
        # (2 unchanged attributes hidden)
    }

  # azurerm_role_assignment.monitoring_reader["DTS-SHAREDSERVICES-DEMO"] will be created
  + resource "azurerm_role_assignment" "monitoring_reader" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "a26d6f55-771b-4eed-b84a-6976ec884c12"
      + principal_type                   = "ServicePrincipal"
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Monitoring Reader"
      + scope                            = "/subscriptions/6c4d2513-a873-41b4-afdd-b05a33206631/resourceGroups/sds-alerts-slack-ptl/providers/Microsoft.Insights/actionGroups/sds-alerts-slack-warning-alerts"
      + skip_service_principal_aad_check = (known after apply)
    }

  # azurerm_role_assignment.monitoring_reader["DTS-SHAREDSERVICES-DEV"] will be created
  + resource "azurerm_role_assignment" "monitoring_reader" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "ac456836-3083-4e87-9107-35bec95926d5"
      + principal_type                   = "ServicePrincipal"
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Monitoring Reader"
      + scope                            = "/subscriptions/6c4d2513-a873-41b4-afdd-b05a33206631/resourceGroups/sds-alerts-slack-ptl/providers/Microsoft.Insights/actionGroups/sds-alerts-slack-warning-alerts"
      + skip_service_principal_aad_check = (known after apply)
    }

  # azurerm_role_assignment.monitoring_reader["DTS-SHAREDSERVICES-ITHC"] will be created
  + resource "azurerm_role_assignment" "monitoring_reader" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "23101045-7ca9-444d-9b67-8d408465126a"
      + principal_type                   = "ServicePrincipal"
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Monitoring Reader"
      + scope                            = "/subscriptions/6c4d2513-a873-41b4-afdd-b05a33206631/resourceGroups/sds-alerts-slack-ptl/providers/Microsoft.Insights/actionGroups/sds-alerts-slack-warning-alerts"
      + skip_service_principal_aad_check = (known after apply)
    }

  # azurerm_role_assignment.monitoring_reader["DTS-SHAREDSERVICES-PROD"] will be created
  + resource "azurerm_role_assignment" "monitoring_reader" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "0ad7e647-a69f-4602-801e-c376779334c2"
      + principal_type                   = "ServicePrincipal"
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Monitoring Reader"
      + scope                            = "/subscriptions/6c4d2513-a873-41b4-afdd-b05a33206631/resourceGroups/sds-alerts-slack-ptl/providers/Microsoft.Insights/actionGroups/sds-alerts-slack-warning-alerts"
      + skip_service_principal_aad_check = (known after apply)
    }

  # azurerm_role_assignment.monitoring_reader["DTS-SHAREDSERVICES-SBOX"] will be created
  + resource "azurerm_role_assignment" "monitoring_reader" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "6e3f5588-8805-4fcd-98d7-dc5a2d6e7011"
      + principal_type                   = "ServicePrincipal"
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Monitoring Reader"
      + scope                            = "/subscriptions/6c4d2513-a873-41b4-afdd-b05a33206631/resourceGroups/sds-alerts-slack-ptl/providers/Microsoft.Insights/actionGroups/sds-alerts-slack-warning-alerts"
      + skip_service_principal_aad_check = (known after apply)
    }

  # azurerm_role_assignment.monitoring_reader["DTS-SHAREDSERVICES-STG"] will be created
  + resource "azurerm_role_assignment" "monitoring_reader" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "9811e238-e068-4802-a13c-f67a5945f03f"
      + principal_type                   = "ServicePrincipal"
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Monitoring Reader"
      + scope                            = "/subscriptions/6c4d2513-a873-41b4-afdd-b05a33206631/resourceGroups/sds-alerts-slack-ptl/providers/Microsoft.Insights/actionGroups/sds-alerts-slack-warning-alerts"
      + skip_service_principal_aad_check = (known after apply)
    }

  # azurerm_role_assignment.monitoring_reader["DTS-SHAREDSERVICES-TEST"] will be created
  + resource "azurerm_role_assignment" "monitoring_reader" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "250331e9-0752-4df7-92a9-fa467da91afa"
      + principal_type                   = "ServicePrincipal"
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Monitoring Reader"
      + scope                            = "/subscriptions/6c4d2513-a873-41b4-afdd-b05a33206631/resourceGroups/sds-alerts-slack-ptl/providers/Microsoft.Insights/actionGroups/sds-alerts-slack-warning-alerts"
      + skip_service_principal_aad_check = (known after apply)
    }

  # azurerm_role_assignment.monitoring_reader["DTS-SHAREDSERVICESPTL"] will be created
  + resource "azurerm_role_assignment" "monitoring_reader" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "cad3dcf5-9ca4-4f45-a219-13a8d8003d9f"
      + principal_type                   = "ServicePrincipal"
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Monitoring Reader"
      + scope                            = "/subscriptions/6c4d2513-a873-41b4-afdd-b05a33206631/resourceGroups/sds-alerts-slack-ptl/providers/Microsoft.Insights/actionGroups/sds-alerts-slack-warning-alerts"
      + skip_service_principal_aad_check = (known after apply)
    }

  # azurerm_role_assignment.monitoring_reader["DTS-SHAREDSERVICESPTL-SBOX"] will be created
  + resource "azurerm_role_assignment" "monitoring_reader" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "88056f13-ab02-414f-9f35-7cfe13a4c19c"
      + principal_type                   = "ServicePrincipal"
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Monitoring Reader"
      + scope                            = "/subscriptions/6c4d2513-a873-41b4-afdd-b05a33206631/resourceGroups/sds-alerts-slack-ptl/providers/Microsoft.Insights/actionGroups/sds-alerts-slack-warning-alerts"
      + skip_service_principal_aad_check = (known after apply)
    }

  # azurerm_service_plan.this will be updated in-place
  ~ resource "azurerm_service_plan" "this" {
        id                              = "/subscriptions/6c4d2513-a873-41b4-afdd-b05a33206631/resourceGroups/sds-alerts-slack-ptl/providers/Microsoft.Web/serverFarms/sds-alerts-slack-ptl"
        name                            = "sds-alerts-slack-ptl"
      ~ tags                            = {
            "application"  = "core"
            "builtFrom"    = "hmcts/azure-alert-to-slack-function"
            "businessArea" = "Cross-Cutting"
            "criticality"  = "High"
            "environment"  = "production"
          - "startupMode"  = "always" -> null
        }
        # (12 unchanged attributes hidden)
    }

  # azurerm_storage_account.this will be updated in-place
  ~ resource "azurerm_storage_account" "this" {
      ~ cross_tenant_replication_enabled   = true -> false
        id                                 = "/subscriptions/6c4d2513-a873-41b4-afdd-b05a33206631/resourceGroups/sds-alerts-slack-ptl/providers/Microsoft.Storage/storageAccounts/sdsalertsslackptl"
        name                               = "sdsalertsslackptl"
      ~ tags                               = {
            "application"  = "core"
            "builtFrom"    = "hmcts/azure-alert-to-slack-function"
            "businessArea" = "Cross-Cutting"
            "criticality"  = "High"
            "environment"  = "production"
          - "startupMode"  = "always" -> null
        }
        # (95 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # azurerm_user_assigned_identity.this will be updated in-place
  ~ resource "azurerm_user_assigned_identity" "this" {
        id                  = "/subscriptions/6c4d2513-a873-41b4-afdd-b05a33206631/resourceGroups/sds-alerts-slack-ptl/providers/Microsoft.ManagedIdentity/userAssignedIdentities/sds-alerts-slack-ptl"
        name                = "sds-alerts-slack-ptl"
      ~ tags                = {
          - "application"  = "core" -> null
          - "builtFrom"    = "hmcts/azure-alert-to-slack-function" -> null
          - "businessArea" = "Cross-Cutting" -> null
          - "environment"  = "production" -> null
        }
        # (5 unchanged attributes hidden)
    }

  # azurerm_windows_function_app.this will be updated in-place
  ~ resource "azurerm_windows_function_app" "this" {
        id                                             = "/subscriptions/6c4d2513-a873-41b4-afdd-b05a33206631/resourceGroups/sds-alerts-slack-ptl/providers/Microsoft.Web/sites/sds-alerts-slack-ptl"
        name                                           = "sds-alerts-slack-ptl"
      ~ tags                                           = {
            "application"                                    = "core"
            "builtFrom"                                      = "hmcts/azure-alert-to-slack-function"
            "businessArea"                                   = "Cross-Cutting"
            "criticality"                                    = "High"
            "environment"                                    = "production"
          - "hidden-link: /app-insights-conn-string"         = "InstrumentationKey=5c737b36-e44d-475b-9cf6-07c00d57ee32;IngestionEndpoint=https://uksouth-1.in.applicationinsights.azure.com/;LiveEndpoint=https://uksouth.livediagnostics.monitor.azure.com/;ApplicationId=12dea939-4021-4e21-8c6e-4e0ea3c9a6e3" -> null
          - "hidden-link: /app-insights-instrumentation-key" = "5c737b36-e44d-475b-9cf6-07c00d57ee32" -> null
          - "hidden-link: /app-insights-resource-id"         = "/subscriptions/6c4d2513-a873-41b4-afdd-b05a33206631/resourceGroups/sds-alerts-slack-ptl/providers/microsoft.insights/components/sds-alerts-ptl" -> null
          - "startupMode"                                    = "always" -> null
        }
        # (34 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.application_insights.azurerm_application_insights.this will be updated in-place
  ~ resource "azurerm_application_insights" "this" {
        id                                    = "/subscriptions/6c4d2513-a873-41b4-afdd-b05a33206631/resourceGroups/sds-alerts-slack-ptl/providers/Microsoft.Insights/components/sds-alerts-ptl"
        name                                  = "sds-alerts-ptl"
      ~ tags                                  = {
            "application"  = "core"
            "builtFrom"    = "hmcts/azure-alert-to-slack-function"
            "businessArea" = "Cross-Cutting"
            "criticality"  = "High"
            "environment"  = "production"
          - "startupMode"  = "always" -> null
        }
        # (16 unchanged attributes hidden)
    }

  # module.application_insights.azurerm_monitor_activity_log_alert.main[0] will be updated in-place
  ~ resource "azurerm_monitor_activity_log_alert" "main" {
        id                  = "/subscriptions/6c4d2513-a873-41b4-afdd-b05a33206631/resourceGroups/sds-alerts-slack-ptl/providers/Microsoft.Insights/activityLogAlerts/Application Insights daily cap reached - sds-alerts-ptl"
        name                = "Application Insights daily cap reached - sds-alerts-ptl"
      ~ tags                = {
            "application"  = "core"
            "builtFrom"    = "hmcts/azure-alert-to-slack-function"
            "businessArea" = "Cross-Cutting"
            "criticality"  = "High"
            "environment"  = "production"
          - "startupMode"  = "always" -> null
        }
        # (5 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

Plan: 9 to add, 8 to change, 0 to destroy.
```

</details>





<!-- github-comment: {"Command":"plan","PRNumber":33,"Program":"tfcmt","SHA1":"","Target":"sds_ptl - TerraformPlanApply","Vars":{}} -->